32 32
260 260
42 42
45 45
105 110
262 262
32 42
261 261
101 114
263 263
260 32
114 101
111 110
61 61
100 101
265 265
97 116
115 116
47 47
32 116
32 48
101 110
41 59
115 101
108 101
111 114
10 270
32 99
97 114
264 116
97 110
32 61
10 9
269 269
104 101
32 40
97 108
105 116
105 102
274 102
32 73
105 99
32 102
45 62
267 267
273 273
266 47
105 100
99 116
264 101
275 275
105 115
279 294
32 115
32 112
48 48
32 98
47 42
32 108
105 272
32 97
32 117
299 309
111 117
114 105
118 111
9 9
97 109
32 123
111 102
261 270
264 103
32 49
101 100
325 307
108 111
101 115
101 116
117 114
102 120
73 78
32 83
293 293
10 10
105 109
32 271
32 100
32 110
32 109
117 116
69 82
97 100
32 84
114 111
99 104
32 34
32 119
290 100
105 103
108 117
101 108
279 111
32 278
32 264
276 97
281 116
101 120
300 339
32 76
112 101
305 305
278 278
99 107
32 67
338 110
97 115
10 330
277 114
32 92
97 103
32 329
116 374
32 65
111 112
32 80
97 98
79 82
283 116
105 122
276 101
99 101
32 125
79 78
10 32
83 116
32 289
110 116
117 109
65 82
287 272
310 310
111 109
292 9
117 101
111 108
32 60
51 50
101 102
32 70
76 69
32 38
47 262
121 369
98 106
388 101
117 110
281 100
32 71
32 45
99 359
97 283
366 116
32 78
32 50
105 284
32 64
111 116
117 102
112 116
105 108
101 308
419 274
117 115
82 69
32 95
117 108
101 109
385 284
10 267
32 317
118 268
277 276
73 84
105 277
321 289
99 272
111 274
68 364
69 78
104 116
276 319
324 407
288 327
264 431
32 82
287 104
98 451
77 65
327 101
302 285
32 311
261 32
342 342
97 112
68 69
83 84
97 121
32 79
115 99
32 66
279 104
318 118
83 69
80 73
285 116
97 271
111 413
32 357
304 304
116 104
32 118
271 381
115 115
272 103
268 114
32 298
10 286
379 101
371 371
32 68
296 108
32 103
32 334
117 308
65 84
118 101
70 70
112 452
266 41
32 273
438 270
112 108
281 283
95 95
73 110
288 116
301 502
102 268
111 100
73 67
116 412
34 44
377 493
65 76
111 289
32 105
370 370
32 85
32 77
42 47
49 54
399 277
32 69
102 358
32 87
32 104
354 288
441 301
41 41
85 84
112 349
65 78
32 277
70 88
111 119
67 76
32 285
65 83
345 381
85 76
335 372
115 319
296 403
32 107
324 103
455 288
103 337
268 110
358 110
326 326
97 372
323 116
32 39
108 118
109 97
105 114
32 43
72 69
329 116
394 114
32 274
301 101
416 298
261 260
98 427
32 124
48 50
308 319
100 114
470 311
119 475
297 104
383 121
73 68
54 52
84 82
120 68
375 107
69 88
118 561
114 290
558 570
336 115
32 101
559 331
292 326
105 111
93 59
32 86
117 289
65 68
316 101
109 365
73 339
321 283
58 58
357 284
110 100
49 48
97 107
125 59
264 297
544 449
32 290
115 414
360 283
117 112
49 50
576 70
112 114
32 33
271 101
32 114
67 272
323 396
99 99
114 297
32 411
78 83
71 447
115 268
69 83
84 73
58 40
510 299
32 386
67 72
368 506
115 112
101 119
43 43
84 350
435 116
117 98
316 121
78 85
368 86
617 60
40 41
313 414
400 400
344 101
32 51
40 282
34 282
514 268
82 79
421 547
112 474
105 336
100 364
539 76
484 285
65 66
32 272
77 79
265 262
315 315
32 121
99 108
114 121
271 351
290 110
356 104
335 276
77 80
32 10
117 271
375 115
391 44
108 108
84 72
32 196
114 323
48 49
97 99
274 120
32 62
111 115
335 99
344 268
83 66
97 390
288 103
101 103
40 34
98 111
415 567
65 67
111 99
83 73
297 115
102 285
111 103
41 123
488 488
116 97
271 599
54 48
340 71
40 38
118 365
70 84
42 44
105 98
50 48
32 512
264 100
271 482
101 121
268 109
125 44
100 100
662 360
56 48
40 40
32 281
316 427
300 78
352 557
41 44
108 379
347 426
120 70
673 112
302 424
398 84
304 267
49 49
32 72
73 83
32 52
580 115
635 77
46 46
631 78
115 548
268 105
113 117
290 103
110 458
73 71
32 476
67 79
268 115
108 281
105 495
323 114
32 58
578 735
320 271
77 85
356 571
32 366
32 56
98 349
324 440
300 533
314 645
609 289
300 110
341 581
104 268
445 277
32 120
610 61
572 602
422 651
473 79
83 67
352 294
382 78
77 69
108 121
32 283
346 364
108 100
413 430
267 32
90 69
97 277
73 533
73 79
616 101
102 102
79 529
113 403
105 271
321 110
742 430
353 109
410 38
82 101
316 111
401 112
288 121
67 104
116 109
377 331
114 99
69 68
116 353
296 679
32 37
346 311
67 392
62 62
268 116
509 69
32 75
83 80
68 494
324 755
435 483
114 97
120 67
98 268
83 350
112 353
656 47
443 268
109 436
288 100
462 462
335 119
811 65
98 550
41 282
79 76
302 687
313 117
117 284
80 340
32 111
736 333
111 271
115 104
655 68
116 112
84 412
32 344
448 84
314 353
80 76
111 277
32 53
116 101
71 768
516 516
116 114
618 584
84 89
434 95
109 112
76 79
397 816
101 99
105 112
99 117
47 640
108 483
99 112
118 296
117 97
42 282
467 70
42 41
347 429
290 390
114 114
120 69
86 808
672 188
50 53
535 85
212 180
480 542
285 100
85 82
399 523
105 296
116 268
318 281
351 568
503 503
117 428
398 69
32 383
85 409
318 483
318 863
100 311
109 116
49 52
297 121
295 42
284 592
445 523
32 322
32 387
771 89
484 885
449 838
32 208
267 270
274 118
79 702
271 103
490 826
108 309
441 432
267 260
417 447
60 60
102 103
120 496
98 420
404 285
508 831
112 264
358 449
48 51
10 260
103 101
103 479
707 534
565 124
99 420
837 888
320 115
316 420
369 99
386 84
122 102
99 401
671 350
73 396
268 102
98 284
107 115
281 397
105 120
32 88
118 333
98 697
83 268
308 108
712 708
429 108
79 84
468 114
501 466
32 297
317 33
41 40
32 89
79 349
351 99
302 664
87 886
117 277
80 69
438 330
373 766
442 73
101 333
53 48
73 76
110 111
32 490
859 275
65 71
276 104
341 906
973 959
675 294
336 112
108 276
276 432
73 82
65 77
313 104
517 681
102 424
33 60
281 99
102 111
786 277
49 51
747 390
32 605
82 531
32 276
937 682
615 582
597 268
109 463
433 83
633 108
58 278
440 541
68 82
276 285
73 77
97 120
49 56
300 83
104 596
793 404
71 797
10 461
97 632
84 79
294 372
85 78
108 443
704 114
564 507
315 48
465 82
50 51
417 843
271 281
285 121
119 119
68 67
264 107
296 283
83 76
351 100
86 542
732 507
119 783
110 299
279 412
111 284
115 285
69 67
101 101
298 1033
443 812
73 100
102 611
120 116
43 61
272 116
394 389
284 308
313 99
352 104
276 333
874 464
532 100
405 60
556 61
287 572
32 47
295 40
294 351
109 100
307 479
717 507
277 389
32 57
801 108
110 421
394 978
524 398
86 350
271 115
653 409
114 458
345 115
290 344
118 542
117 505
1067 991
321 995
345 103
373 392
102 664
80 474
301 107
439 984
32 875
613 523
68 101
271 327
97 119
32 303
110 397
422 83
442 72
32 551
52 48
386 68
1044 1044
302 790
346 1040
287 108
359 97
93 44
97 117
97 308
998 301
281 268
338 271
118 105
49 53
274 579
332 48
457 88
658 323
325 977
73 70
1113 424
340 84
39 44
404 100
83 68
116 336
357 108
102 721
298 301
83 414
32 296
116 111
279 114
109 446
367 83
80 353
479 311
335 103
287 420
84 680
32 106
67 75
73 779
110 437
297 319
208 190
323 938
263 45
340 1051
112 281
93 46
98 121
343 330
77 446
45 61
117 526
32 202
105 365
102 387
83 75
208 176
116 319
304 260
817 871
99 98
111 495
65 473
970 819
524 1092
268 101
404 824
73 102
54 698
79 80
695 695
10 478
80 83
272 101
277 100
367 76
310 265
117 103
1174 776
302 1165
32 91
32 215
375 104
696 264
311 541
284 482
409 88
321 115
1149 1149
271 389
79 777
65 116
313 581
267 261
116 436
51 51
115 119
67 70
208 181
554 120
69 84
66 420
117 105
99 105
32 54
898 100
80 84
332 49
67 67
710 1183
80 79
639 329
117 296
66 85
102 116
112 100
316 697
283 100
294 100
287 401
277 868
1178 331
111 693
340 964
1222 513
271 102
1221 284
525 596
788 834
79 71
65 65
109 115
1049 311
109 276
363 530
112 807
332 54
356 285
1223 1137
83 392
467 935
32 41
299 1011
320 947
1106 396
622 392
32 652
108 466
417 337
69 77
590 67
206 170
72 84
297 880
442 89
67 83
112 104
99 614
302 1027
32 203
103 271
112 117
74 1238
367 1009
287 446
534 110
267 330
100 756
51 48
582 487
69 396
869 285
99 446
276 746
338 1036
284 120
116 294
206 187
690 779
284 288
80 85
433 81
345 351
348 466
630 59
313 931
332 50
111 372
114 466
464 70
99 100
549 326
340 68
48 52
298 111
328 38
318 506
390 428
32 211
121 115
32 55
107 709
347 111
78 458
455 713
208 184
367 1081
264 676
1121 268
267 461
50 52
116 421
214 164
394 100
69 701
116 577
716 437
348 446
344 648
278 823
32 46
347 629
50 315
327 112
279 641
72 596
277 505
337 762
77 67
10 304
67 108
99 582
118 360
684 820
287 794
109 264
48 56
677 61
71 337
281 541
109 117
796 713
85 73
67 614
348 436
287 614
100 555
660 428
85 69
10 261
119 264
85 681
103 268
373 272
55 55
112 586
630 41
830 777
66 79
344 297
1127 403
314 452
397 365
80 68
1091 584
465 494
112 99
320 1259
1366 333
32 35
32 284
297 354
116 641
341 116
408 386
101 351
659 668
301 104
491 337
66 691
287 290
470 276
341 337
347 855
1269 660
110 99
32 902
385 360
1318 462
105 333
111 107
298 299
69 76
967 1253
281 437
119 109
318 1016
356 948
287 383
116 272
288 546
87 77
342 1142
320 112
83 82
109 101
83 473
32 602
1234 121
384 121
268 541
338 450
76 86
531 84
202 177
102 115
70 76
480 296
670 268
585 9
535 75
504 676
349 104
111 440
457 1154
833 98
346 737
653 1392
1387 1401
57 54
428 114
32 263
101 701
85 472
347 458
76 73
85 65
207 162
522 810
620 943
454 1332
544 1351
84 69
121 284
97 429
105 118
40 42
1236 939
87 571
86 957
409 78
945 579
230 177
87 1095
594 100
1451 190
344 487
32 910
109 1160
75 69
121 277
663 1376
67 68
430 285
66 427
83 101
210 187
83 337
109 577
848 516
32 1000
118 1272
67 82
884 884
264 986
274 100
532 389
284 100
67 77
110 629
1425 1470
41 519
555 277
112 514
78 111
851 961
454 84
435 108
114 116
384 646
350 82
88 80
345 1438
504 530
363 676
97 264
84 88
116 333
1076 622
1497 621
408 70
346 756
805 70
423 315
300 665
97 495
67 85
422 949
346 111
93 91
10 292
362 47
341 1038
98 297
51 56
1099 668
98 1176
1098 333
271 116
468 1022
32 377
84 641
32 365
102 892
101 112
98 112
97 354
432 268
543 619
686 404
87 925
335 283
395 901
83 72
110 103
267 563
741 1251
368 73
32 81
115 397
103 724
432 104
119 104
1180 162
1140 208
68 730
1163 785
1397 649
68 350
69 1270
692 109
32 683
32 96
73 80
314 271
603 121
340 69
621 83
48 55
895 40
290 116
276 354
1346 111
196 176
457 71
68 457
314 264
450 115
66 297
108 102
195 187
70 611
32 416
112 972
716 397
979 81
304 32
109 272
383 281
67 84
64 34
809 1291
806 806
804 951
513 76
50 49
311 1217
40 1579
1093 530
54 566
57 1020
115 105
112 268
739 117
108 289
543 709
856 349
354 968
324 118
101 277
300 102
1592 487
801 1417
67 1260
294 920
112 105
120 112
508 268
323 776
415 540
48 54
320 100
115 799
10 727
415 834
332 51
705 1588
99 908
49 57
472 84
560 579
84 77
316 349
323 283
285 103
290 121
734 47
345 116
32 933
287 914
110 331
93 282
279 1031
109 108
1196 71
32 798
83 89
1185 782
82 65
1424 1182
555 116
67 69
415 99
279 710
112 290
575 76
222 184
102 309
1459 436
289 993
116 812
32 288
115 114
588 1409
1646 272
79 496
73 66
67 858
628 105
302 721
565 61
830 354
337 268
878 76
448 472
475 97
1406 115
1078 820
1463 507
102 100
79 83
352 101
469 84
268 1002
323 597
85 726
119 1060
491 580
1596 1132
1670 1677
209 128
1258 181
32 126
268 97
341 68
208 189
398 68
501 301
32 63
53 53
112 271
966 57
739 284
353 119
946 114
457 80
1024 119
39 115
417 825
108 704
348 960
985 121
1678 649
686 120
32 406
382 670
313 989
341 473
405 61
734 46
318 443
318 1600
472 76
532 505
112 487
367 77
99 1059
116 110
352 79
356 616
760 1653
99 917
80 646
326 9
41 303
738 787
688 67
1072 632
445 100
119 101
70 965
209 130
209 129
688 75
79 86
415 101
318 309
117 100
1312 1166
281 924
117 336
509 1663
78 855
32 527
40 33
382 71
327 1682
314 737
568 1088
109 109
100 689
113 307
882 924
99 111
320 308
1161 68
348 918
345 987
1754 1261
32 233
65 772
321 505
105 107
50 50
359 115
79 66
1501 741
891 112
320 615
321 112
634 1120
1058 268
105 360
543 1066
287 1243
85 83
335 351
316 297
288 649
854 71
302 611
429 881
313 111
517 110
39 116
1771 100
32 1241
321 620
1186 98
70 82
86 73
32 307
445 102
271 738
91 93
547 296
80 80
69 1043
52 56
87 68
32 310
678 1139
320 482
1395 1777
114 112
379 554
1284 1123
69 896
116 115
65 89
1792 1700
706 667
491 1105
313 548
346 1141
622 77
363 431
271 308
869 466
79 75
65 108
1458 89
86 841
373 104
689 1361
120 784
77 76
181 196
356 101
277 1442
80 82
318 111
324 428
108 506
1096 1096
344 103
348 463
302 1481
298 121
32 464
1353 873
314 474
1642 115
348 1004
345 1724
191 198
1129 858
321 860
271 113
1832 115
121 112
84 80
469 69
79 573
525 1164
329 1153
34 41
430 319
72 1307
274 396
34 59
604 329
663 281
206 186
363 1252
287 296
423 674
32 205
201 1844
1867 188
301 1156
103 389
108 1181
68 86
337 104
202 185
1322 284
67 1644
654 773
32 421
99 1013
82 88
47 310
997 83
1639 1211
842 1330
321 526
941 360
65 1817
380 1153
331 724
522 1138
82 120
753 112
313 606
287 917
76 76
454 101
318 1358
690 392
739 101
534 268
448 68
80 264
70 285
1541 424
116 1399
352 67
1881 656
400 1175
464 871
76 1555
191 180
118 103
109 795
537 72
677 62
71 825
684 268
1799 819
75 709
79 1136
35 35
343 32
80 575
1280 1341
66 89
1649 101
32 262
392 71
1924 433
66 76
98 108
792 987
70 73
287 908
814 119
772 77
32 122
329 102
279 732
568 118
388 450
109 357
97 297
268 121
354 713
114 327
348 577
322 100
729 573
116 108
97 284
112 1104
1014 67
120 66
284 420
114 103
69 1138
598 574
391 59
71 65
99 853
1048 114
118 97
1187 1187
861 359
392 69
102 1071
467 86
314 505
1190 401
82 1535
335 116
1597 389
433 590
337 374
67 73
1343 1023
109 918
200 161
357 822
85 433
99 1530
48 57
298 105
426 111
319 115
99 338
284 1870
753 1296
77 272
1151 185
1872 76
539 398
209 161
1143 83
655 464
332 52
335 98
301 296
314 487
1758 1911
840 487
423 566
620 116
109 98
663 424
479 268
116 680
78 651
102 1045
448 743
550 337
100 1141
539 84
468 108
583 701
287 490
956 530
50 574
384 726
2020 509
2021 1993
281 390
76 506
1035 290
314 514
68 699
333 105
208 187
426 762
87 82
95 59
80 104
287 540
85 110
1655 529
1965 628
2037 1763
86 513
433 71
50 56
879 1410
71 428
1402 1686
609 1804
99 1278
1843 100
1464 1047
751 88
346 1823
464 68
422 79
279 437
112 475
382 82
537 817
1489 386
343 10
80 350
981 1607
363 909
79 110
53 54
87 73
83 104
51 54
332 55
1434 800
66 65
490 121
111 98
279 436
571 268
1503 2068
599 101
1195 1370
832 1694
321 105
347 397
382 112
196 163
77 463
1003 442
109 297
100 116
549 549
432 98
77 66
300 396
365 660
78 1556
525 375
384 353
398 71
480 288
202 190
384 645
344 450
80 514
70 69
862 307
313 119
68 115
117 994
547 360
382 108
100 331
80 121
264 1219
316 432
304 270
590 1001
50 54
489 76
76 1026
55 56
314 114
528 41
1873 508
445 116
80 1394
284 846
80 72
301 116
633 101
112 678
108 1026
32 216
508 121
70 721
98 288
112 115
314 1208
111 426
77 769
72 1374
119 877
341 72
55 48
354 290
100 276
355 1625
496 84
118 860
287 1013
105 283
522 1490
350 626
2148 1412
2149 1426
408 442
2151 2091
384 878
2153 1209
2154 472
333 554
112 762
382 1025
1893 648
32 229
518 2150
501 389
760 99
501 1388
104 844
217 182
367 1448
454 1975
69 120
696 429
686 495
99 914
103 1354
395 993
489 457
424 100
566 52
320 2171
1076 851
66 121
276 667
60 47
82 465
955 323
688 84
283 101
121 1144
82 84
40 503
70 386
80 726
353 426
68 83
833 440
84 111
194 181
744 272
82 430
454 1757
2187 458
1107 629
115 416
829 115
359 836
2056 84
32 113
99 404
32 802
32 90
759 102
583 2073
288 109
373 86
99 1188
535 1920
99 540
659 1152
83 360
73 109
369 333
771 68
934 1576
496 496
1155 208
1214 389
40 95
304 261
440 116
51 49
83 85
115 121
750 97
85 620
549 9
1538 1913
1037 84
356 783
69 69
52 52
79 77
114 113
102 1293
367 1656
945 440
264 530
2157 296
1488 1789
2247 2051
327 976
301 336
73 401
277 550
657 315
363 1219
98 1716
2147 1882
65 110
356 1060
264 795
100 117
1718 331
316 691
32 44
54 54
1643 360
100 554
318 780
83 99
1621 1398
75 70
1998 296
279 680
1796 1338
2103 957
874 2027
517 472
119 100
99 1606
468 1831
316 337
32 691
1849 336
99 284
100 389
469 529
861 117
348 1268
83 65
1815 100
491 724
887 1672
390 746
32 282
394 1087
796 290
32 1569
32 1250
1574 1857
32 74
646 77
82 336
683 115
121 353
2015 264
1229 1229
110 115
112 112
341 84
76 751
399 1064
61 34
80 932
296 548
2050 450
964 392
1549 450
83 535
426 101
501 121
115 1298
109 1622
78 1759
73 1193
99 1561
120 97
102 112
32 212
1086 579
489 65
108 1386
336 99
350 65
2048 285
76 1435
97 2176
57 57
478 478
116 383
627 100
448 85
314 2197
368 2083
2342 800
1884 285
689 432
613 1064
2329 1563
320 712
347 421
281 117
373 1168
753 1595
320 102
32 1770
1364 1774
287 111
349 111
501 105
840 2164
105 369
84 2125
114 272
628 272
105 437
213 181
299 1539
389 103
81 117
552 92
279 421
39 58
54 51
68 311
32 1645
65 2304
300 751
1012 77
116 1043
52 50
368 1435
1892 708
99 114
49 55
271 99
32 976
1676 1496
524 557
467 529
69 597
469 79
65 465
1517 862
980 2332
116 331
494 69
491 1354
384 1400
314 710
283 1568
580 923
79 87
654 101
103 1225
323 2361
1274 586
718 2275
2138 1583
1536 1070
2387 935
32 457
784 387
279 577
415 299
1472 1472
49 315
2347 621
804 437
182 168
367 69
332 56
313 268
513 472
83 83
2011 1547
104 568
84 344
2003 50
1098 101
316 540
348 508
287 766
68 73
65 947
300 80
32 1454
404 349
41 46
40 528
459 1232
1853 1146
517 283
1068 1898
1230 103
531 68
698 966
423 48
384 1208
419 2107
100 112
408 1028
1079 575
32 647
274 1246
32 436
1123 450
2249 682
737 296
936 901
278 1468
313 112
348 264
467 110
887 281
300 1477
118 1462
430 333
1728 281
82 73
551 98
1562 1454
872 2196
276 336
311 104
2280 2467
116 437
86 69
66 442
504 297
626 398
818 99
290 115
320 994
417 1105
112 505
84 1082
1798 1228
89 1971
2064 472
1130 1407
68 979
83 2104
89 2404
323 115
504 986
105 274
51 53
70 1953
84 120
70 1636
1536 1426
699 83
32 1708
288 354
352 82
278 47
84 104
522 1821
730 699
48 53
661 121
288 283
1218 2358
367 1737
1037 1244
115 122
907 115
105 629
66 398
277 1087
469 537
68 2315
63 63
1328 270
536 100
2398 297
2512 868
2133 115
1752 877
1725 448
2351 2487
70 1071
1761 101
793 2025
551 530
99 794
209 143
787 1184
760 1252
688 69
300 68
377 1869
105 101
818 1407
116 385
98 2129
214 181
363 2448
426 116
429 100
491 1422
71 724
2044 437
117 120
298 99
86 116
774 1047
340 1910
112 103
1782 1184
2550 1629
1897 1566
80 452
1581 1581
1991 2096
828 1547
1933 409
98 100
285 109
318 1088
2520 730
1079 2521
2571 83
71 66
32 2030
417 1225
468 294
78 629
356 925
32 198
417 768
56 51
120 65
314 1104
105 786
433 70
454 336
76 1738
324 285
382 473
578 84
575 828
98 540
93 41
39 41
494 1981
2451 2185
1239 2488
2055 2508
70 424
54 49
632 301
264 1585
429 894
307 268
302 1045
115 633
99 1745
443 744
67 2393
352 932
1146 846
298 116
870 1362
891 951
98 691
313 633
422 392
743 77
532 550
861 121
110 268
104 1181
80 398
1079 78
638 44
276 401
1525 309
56 1167
50 55
77 340
296 116
2128 178
68 756
66 83
672 163
87 2085
1801 807
1746 2246
83 581
729 2565
103 284
2260 390
32 1115
68 1452
194 188
345 2541
2640 83
347 965
86 1960
205 168
114 119
593 83
545 923
1248 841
805 2591
907 820
787 308
78 84
2100 2595
408 2300
358 104
67 401
50 57
337 354
659 97
67 540
355 92
342 293
100 119
234 2418
32 574
115 558
442 69
68 80
80 71
1542 1436
297 101
332 53
408 285
116 693
284 567
1001 73
77 2340
71 1620
752 551
281 118
559 2124
1638 331
663 401
469 111
2080 975
281 1036
804 112
302 374
2694 1585
340 1788
2696 699
2697 2654
2624 2514
1838 513
2700 2501
1864 1476
99 780
1428 988
115 108
112 111
1416 1739
1102 283
418 61
72 79
284 1331
99 290
56 56
537 83
114 415
76 1740
1939 2084
77 577
792 351
79 68
68 66
618 1887
102 117
367 2375
375 2004
84 437
971 69
737 508
891 437
109 375
295 33
1122 115
71 69
348 2627
1521 787
80 1202
525 1504
49 714
463 105
68 389
545 1103
1102 120
408 1636
100 468
289 901
459 109
496 350
105 105
327 336
301 115
489 101
887 1156
463 975
1114 79
1369 1331
344 397
1811 1050
478 727
228 184
1403 67
2168 115
1212 2747
2588 894
118 1883
71 78
1041 120
77 918
112 896
283 103
340 631
274 1515
313 799
208 182
696 308
313 1647
345 387
1193 2162
583 896
1315 100
112 1540
318 693
1329 1152
1408 1189
65 2014
1764 74
114 100
78 446
408 2422
630 694
114 379
65 1421
382 2377
100 99
112 351
388 333
288 107
53 52
399 1601
408 76
56 873
287 1561
86 1852
2576 2730
743 76
82 407
607 48
1224 941
84 1440
108 780
32 299
340 464
2368 1944
209 131
2117 289
32 1603
85 66
99 766
445 1310
379 336
99 975
297 284
32 640
932 1412
32 201
1845 2636
1650 1287
1352 523
78 79
508 331
480 97
99 1273
84 78
656 42
200 188
346 119
300 1171
304 461
99 435
76 309
320 98
57 48
1102 100
686 822
1415 1914
196 188
840 2768
264 909
66 513
73 1019
1288 2784
54 56
981 474
39 59
524 1095
619 1383
111 351
264 277
116 1031
1212 71
287 1273
804 2665
1364 69
1503 2823
555 100
105 301
1733 67
352 111
283 108
97 102
2504 1347
2682 1068
619 2273
1506 808
356 375
621 80
780 268
67 908
2861 680
1286 337
72 108
99 115
448 1070
368 1740
415 107
696 354
854 2848
469 89
1333 1624
76 1286
2279 285
518 577
264 331
276 331
32 447
1169 1169
1521 660
741 78
67 794
65 967
942 1825
68 554
32 2670
2601 290
1146 1120
463 112
97 615
77 84
104 115
397 112
659 107
564 102
109 1268
663 1035
290 1941
214 183
517 726
70 1028
104 1307
62 40
84 577
394 505
353 670
56 49
532 1980
202 188
359 109
115 100
67 1279
84 114
401 101
77 436
314 1886
276 268
264 403
83 989
1029 2680
2936 724
890 76
463 807
2939 667
394 109
271 387
66 540
665 409
99 490
271 97
78 426
71 635
634 846
70 1809
467 1144
970 2833
314 268
818 2642
83 548
67 446
102 1784
2352 101
743 1850
52 53
102 108
83 87
392 84
462 263
805 84
47 62
1348 286
97 118
2367 1023
73 465
32 230
301 939
119 285
71 1225
73 392
87 340
788 1184
1125 548
366 1595
287 1422
2028 97
384 1104
208 188
80 1590
1186 331
268 111
268 943
345 2954
821 1457
1014 84
109 508
301 353
535 2714
409 68
57 56
1736 586
386 69
209 139
463 301
367 2043
32 2400
116 2200
298 1388
80 590
1553 2054
203 181
2121 2880
469 420
102 435
102 2204
68 407
268 450
318 2532
1357 828
368 1738
1746 508
516 305
110 429
360 108
1107 274
66 432
51 52
1651 118
2170 115
821 387
2186 107
1689 118
405 47
294 482
102 687
264 296
2069 472
275 819
747 283
314 972
475 100
1048 1022
266 44
442 409
288 1287
2353 881
41 38
49 2177
2483 296
417 635
84 1031
1218 1942
352 680
72 1976
618 1741
116 365
343 904
613 512
470 2864
80 67
314 99
859 1908
84 971
407 835
675 894
101 284
395 111
1475 592
985 1606
82 1734
97 111
536 103
359 120
287 404
1016 795
32 301
309 482
66 1118
32 1175
3074 519
539 1928
3067 2914
287 3034
2059 851
403 403
47 1175
3081 42
722 2250
557 1136
332 315
274 108
99 296
1502 51
936 1917
622 772
1676 116
2485 337
1733 448
1395 795
2390 1685
787 567
433 69
1443 437
82 684
2134 104
503 41
358 691
2110 3072
111 1389
489 2849
3105 2036
382 1176
314 1800
77 1004
2031 2673
1610 568
100 493
1385 115
2690 844
70 83
1833 1833
2980 333
32 1979
313 1035
3119 773
316 550
116 732
67 917
279 119
66 2832
743 2990
1114 73
206 167
208 186
640 1908
2524 2259
1753 331
1295 336
3107 960
1767 794
3135 1624
3136 331
2484 649
2979 437
352 3039
900 1966
3106 699
302 1071
84 67
347 446
99 396
52 49
1019 699
3057 42
830 994
2586 2987
1352 1064
479 661
560 118
359 337
3155 3100
100 606
1129 365
78 67
1990 111
231 154
3161 132
557 590
41 124
341 849
513 2897
112 1973
83 2481
97 428
928 83
1814 350
284 1213
727 563
399 118
229 143
296 107
2822 3033
191 218
619 1450
80 849
118 375
518 84
348 115
2095 2364
77 1327
264 905
264 2473
675 353
346 276
119 925
287 822
494 575
208 180
3130 47
1714 468
98 432
116 2466
53 56
110 337
613 2774
470 1164
85 80
809 709
279 1440
81 3080
72 844
1950 114
489 407
1612 330
314 104
423 52
352 72
72 537
728 52
2120 2934
292 10
1540 474
593 77
774 101
86 296
110 1264
386 89
71 67
1180 170
883 745
2649 950
1891 2218
469 297
69 71
1487 99
501 682
332 57
76 349
115 1972
78 68
97 105
116 296
302 2335
445 1601
363 297
1360 1661
2072 112
51 57
70 80
117 2144
489 1228
769 85
877 268
1034 299
87 783
454 1374
228 187
945 298
68 68
210 170
51 55
654 390
271 2363
2710 465
56 54
313 121
302 112
266 40
302 1293
341 2238
121 116
80 972
410 61
118 3098
416 288
101 2181
32 195
118 112
32 1326
67 65
82 980
2102 1370
108 1289
347 272
818 112
77 83
99 822
110 117
2811 88
1925 1441
315 566
32 1468
367 2274
593 1737
115 931
99 271
428 121
657 657
302 1809
112 668
205 183
32 790
912 1383
840 117
323 354
358 297
105 375
314 288
300 509
367 70
76 1461
32 433
110 446
390 105
355 37
318 1386
683 118
110 112
103 797
367 2251
353 116
489 311
108 116
792 113
2973 107
560 1988
518 769
52 54
115 2220
304 563
283 115
3061 109
308 285
112 1533
1003 71
194 183
196 177
1964 1964
378 123
77 68
67 3084
1721 3079
588 542
313 416
97 567
67 1059
473 68
67 665
2018 2766
388 336
603 2641
67 1188
49 1018
1984 268
380 102
2288 2944
110 430
102 965
112 307
202 189
71 83
560 2890
32 1261
470 281
727 461
467 2411
78 337
205 172
2270 3097
378 125
2049 67
328 125
1328 330
120 102
745 924
149 176
1874 195
893 674
83 751
102 790
606 2284
528 123
560 1515
384 514
103 104
2568 296
2926 110
67 914
384 474
2123 89
77 1154
603 2098
612 415
524 3127
93 58
320 1421
207 163
3026 1042
79 1711
112 97
2548 401
287 271
657 1018
276 849
76 693
2136 268
313 496
83 841
1683 75
32 2166
368 3070
626 531
112 383
102 1641
89 961
482 108
208 178
73 2241
3265 3364
433 409
87 573
118 288
67 3029
1207 85
1563 69
2219 487
348 2119
1533 284
112 416
99 572
1117 39
102 2345
120 1632
588 1249
902 115
115 272
755 1398
1727 115
359 1404
230 3371
442 1248
382 2317
3437 340
1532 3093
1819 679
1130 99
56 55
314 1955
97 1421
341 1207
294 2007
786 403
346 1935
480 1883
32 325
1078 2608
454 430
230 163
532 835
428 104
304 330
65 87
715 40
532 1087
114 118
195 185
2198 1691
560 1246
103 1946
112 331
346 307
71 1199
555 113
80 487
292 549
68 1807
368 1461
854 87
491 1444
422 1172
279 853
120 99
341 101
773 1255
723 67
69 671
3179 3092
276 116
494 2975
722 561
324 120
318 1286
108 1358
718 84
321 116
688 557
85 2225
109 103
71 89
80 2012
183 162
102 2306
593 1009
66 1505
85 68
55 57
1190 1926
475 396
341 87
100 98
103 3283
80 2727
1297 166
75 2183
279 424
638 282
99 365
114 463
349 366
366 112
116 379
115 110
290 107
196 183
1279 726
98 101
277 383
69 1605
348 101
65 3423
1329 668
348 835
2741 268
115 989
208 173
206 180
373 1505
593 1448
2190 457
320 2357
620 579
361 112
117 1216
348 112
525 844
283 567
893 49
2373 437
32 1731
1118 268
277 1559
601 1986
1016 450
73 702
294 337
200 168
489 1452
2334 73
99 311
347 2749
111 118
1069 365
86 2517
122 121
422 426
792 99
341 67
377 1961
107 281
70 892
32 207
399 1182
80 1400
316 3059
324 274
70 790
346 555
56 52
70 1641
1058 744
104 1202
695 278
618 1662
104 119
3436 83
117 283
408 687
76 443
836 534
110 118
341 1362
560 3024
363 100
324 336
854 1136
661 115
814 2892
341 931
284 1523
470 290
115 98
32 738
466 115
294 115
1635 3159
1193 112
341 2457
1019 84
360 102
2389 601
274 277
360 121
421 814
80 678
76 1928
518 290
102 824
52 51
360 298
723 69
228 189
88 1825
774 3328
67 1339
69 1821
316 628
279 1399
289 1794
369 308
298 102
2955 296
204 168
515 1895
3628 68
86 1249
341 751
1185 1405
116 426
52 55
276 1926
277 285
33 61
41 91
77 1268
1069 632
375 301
377 745
1288 83
2283 290
337 744
67 1244
638 46
352 1003
67 1583
287 1059
54 55
2130 115
83 799
114 117
616 268
78 397
202 186
447 1124
208 163
2602 2333
103 2303
1826 181
287 975
606 284
266 282
263 59
1858 3349
80 1800
362 984
336 541
83 1028
272 365
85 1116
83 416
554 429
846 277
346 2657
116 1082
3192 2036
119 375
1764 578
2579 189
163 169
1151 190
1329 107
543 1350
423 53
271 836
32 94
349 1398
32 484
79 102
716 2278
313 919
78 77
116 117
205 190
686 426
195 163
1714 2903
70 1640
84 544
960 401
1956 98
271 2292
82 920
99 1243
433 84
692 1232
54 50
320 3269
318 1026
2668 45
83 1647
112 1208
57 3542
2827 1410
2257 2098
67 531
116 120
32 1111
366 856
296 693
903 182
1826 177
2071 3066
78 665
67 66
318 689
828 529
1544 1070
2436 319
112 288
363 277
78 1391
407 116
314 668
1434 465
41 43
185 203
83 79
113 1608
373 1013
80 621
3309 943
1369 1213
55 49
727 260
271 1457
352 3410
71 1205
276 2885
518 68
114 385
696 3726
422 855
311 114
409 86
363 986
80 645
110 272
103 99
120 120
2895 3577
216 182
936 993
408 2754
1062 592
115 323
302 2405
347 1486
83 112
465 1732
70 1780
68 2331
98 351
55 51
575 741
68 84
356 2537
2951 3769
3781 2384
177 163
2652 858
583 1564
81 85
122 3559
354 1899
601 880
67 646
307 100
1323 551
736 296
83 3670
3231 592
217 183
70 1293
672 181
1297 3178
672 184
877 264
522 120
3416 671
3474 281
80 271
2231 1384
110 426
797 112
3212 730
1957 100
220 183
1465 218
32 1868
1862 206
235 3783
2804 386
673 597
314 678
366 609
42 40
1212 70
1130 1330
313 2930
116 281
283 1047
465 726
297 436
426 285
302 100
83 2879
274 1988
70 3187
1643 301
71 458
206 188
32 214
226 3683
2327 184
3453 168
1994 2081
116 424
82 831
560 116
309 100
70 687
2308 494
578 80
1931 2584
103 281
211 191
212 187
118 109
225 3496
1084 1874
1297 162
65 80
348 632
851 3744
2460 682
38 38
590 68
557 1535
3758 1391
120 98
84 732
111 404
41 47
115 97
82 67
1100 76
1571 1482
3812 185
3872 3796
3799 3662
3874 875
1084 1465
1021 2948
3840 1862
3878 1862
3879 2470
3331 47
3881 1645
1084 3519
3883 3392
3699 3531
3885 3814
3886 3725
2296 3851
3888 3657
3889 3765
3566 184
3891 3835
3508 2365
3893 875
1413 2365
3895 1465
2296 3659
2297 2470
3855 1562
32 1311
1297 173
3901 1276
3902 3372
3903 178
1413 3815
3905 1868
3906 1562
3907 3551
1258 190
2824 182
3910 1868
222 3740
3912 190
2435 1436
340 442
385 115
556 43
102 1780
80 690
84 70
66 578
271 987
1748 586
71 76
789 115
52 57
873 54
289 114
287 285
843 1808
313 1604
464 2859
32 333
239 188
2401 78
1029 708
1372 978
377 349
69 100
472 68
1195 463
2436 101
1507 336
287 338
463 3060
478 270
79 464
114 120
79 3848
1532 3549
1869 795
34 1625
1129 799
1684 1304
116 1440
117 2549
119 1943
76 101
71 671
76 483
1519 745
79 1144
515 2241
1275 1404
302 892
1654 1618
417 2613
70 115
3071 109
491 2303
800 457
1103 746
583 1525
287 1188
66 1732
67 1273
276 881
69 89
504 2316
454 3356
2799 1914
615 117
68 1228
1415 971
69 800
354 2362
300 116
2180 1120
284 1496
32 2192
67 2969
862 1739
3679 69
588 1852
441 115
316 112
3494 646
287 1278
1119 65
684 264
290 379
1903 1232
76 1386
76 80
366 297
100 1289
367 2941
2674 2360
2430 1837
115 331
34 720
77 392
704 284
730 79
337 99
1449 3959
82 1757
481 115
204 172
1544 75
369 103
114 351
99 336
554 264
445 1064
290 360
279 112
658 747
65 712
41 58
78 980
738 2023
348 3188
65 86
465 77
112 710
464 769
34 62
71 533
65 529
507 2023
1635 2088
65 1956
95 40
73 88
383 116
307 120
575 89
417 1620
462 269
2419 1287
382 712
531 1003
4042 828
84 421
1086 1515
1610 99
345 308
287 98
344 501
32 232
110 1856
377 3157
3695 3603
535 82
1340 1041
73 509
350 1808
1492 3626
2305 2305
368 2856
836 3036
112 1394
554 277
1107 2493
366 1296
518 436
59 59
717 102
454 590
111 369
105 401
347 3327
83 2765
3415 2423
367 2984
373 665
321 2225
532 1442
100 1139
102 1481
102 110
1658 115
675 336
344 296
108 112
97 369
341 782
335 383
231 148
84 1389
359 2005
912 1030
1602 3605
1197 1679
103 3817
83 121
271 110
285 115
3011 1011
70 79
348 1622
866 40
100 277
421 1338
32 1118
1570 3168
116 119
79 413
365 301
32 36
588 856
472 71
103 1985
384 442
1866 188
373 1188
83 633
115 111
2039 573
1865 53
53 607
65 340
2563 2563
76 529
857 115
102 3660
114 307
85 626
311 331
1135 100
612 116
551 101
348 1560
760 530
653 1391
91 587
86 1409
422 458
3466 3832
1290 9
455 290
119 2537
341 3727
1830 351
386 83
1284 3003
104 281
120 100
302 1784
836 474
288 112
373 1273
32 218
83 365
1119 3185
102 1027
3407 3735
331 284
80 668
73 3667
80 2511
531 71
373 1278
3291 592
51 566
114 357
76 4146
467 80
3611 1211
1251 1850
71 2613
46 2182
287 799
489 83
3591 3550
102 2405
103 264
416 268
65 100
102 1486
65 2946
54 57
498 40
230 152
279 379
4150 2333
619 1729
593 69
1485 2486
2538 414
2356 3801
663 1164
612 351
353 121
1255 97
849 403
359 101
2039 1347
3977 121
67 296
356 1943
679 296
114 98
302 1847
316 1716
314 3503
351 534
67 86
66 350
2506 661
67 799
903 191
1403 1471
32 4050
1428 51
2193 1249
352 971
332 1018
2846 450
952 436
345 3745
102 297
84 294
101 97
1570 3160
404 115
84 1070
298 649
109 2350
70 78
448 4048
110 1172
180 4019
103 1518
2723 3787
1199 67
73 3420
301 2070
300 79
101 98
524 925
3397 1050
278 33
287 1745
50 1018
77 2981
85 1214
82 360
1866 168
3218 468
1714 3696
110 2318
313 365
61 39
1570 3253
3169 667
504 431
543 2105
619 1189
2033 1985
344 117
408 1640
3009 773
642 48
71 2886
67 87
55 53
517 3920
1069 1216
268 1566
73 73
67 1013
465 1248
353 112
346 1264
100 111
108 98
232 175
1578 1019
205 188
32 209
32 1276
3272 182
80 2802
518 1279
1863 2795
105 432
347 534
560 277
1012 80
295 715
56 50
352 114
628 264
4080 782
98 443
725 115
879 667
1107 1474
1477 68
32 286
408 611
99 835
607 56
76 3736
54 53
50 566
363 2316
356 3446
107 3221
3790 83
423 50
423 51
1288 340
408 83
85 513
103 611
72 122
613 1310
358 1598
1347 465
1531 115
302 965
102 759
593 2251
1414 108
316 451
109 121
731 48
399 4090
373 76
100 1264
67 835
399 102
102 97
1125 2510
1812 296
325 107
220 189
1533 309
288 1002
3452 1691
3405 2834
891 3795
2459 305
4185 1249
32 1692
341 104
279 2200
1937 2986
289 268
55 52
591 4188
80 114
1673 450
2842 586
302 1871
112 2728
313 108
273 61
80 433
73 665
793 120
229 164
110 98
88 77
774 1568
314 2012
1121 744
119 3176
287 3207
1151 188
2033 121
2414 2414
408 3632
313 458
899 2394
110 3986
72 101
77 264
762 101
316 288
80 529
494 72
423 49
382 994
1271 99
815 67
324 495
809 3978
2444 409
396 468
4074 268
583 118
480 1462
1389 606
312 283
69 110
264 99
279 344
1488 1012
67 3491
83 906
85 505
480 103
32 3255
77 4307
4418 2218
422 509
457 340
455 1899
32 997
2301 632
70 2391
82 2395
455 505
78 71
84 557
112 1900
68 1930
772 671
112 107
208 161
314 2515
41 913
2089 901
1205 69
100 693
80 2728
365 268
504 2101
112 1886
657 48
469 810
1285 56
332 2177
2626 301
116 344
79 2411
102 1871
345 2363
101 288
3958 1331
727 32
887 3012
426 104
373 794
348 2350
991 2733
70 2963
468 296
90 350
501 120
296 3266
4465 2750
112 297
2419 479
2106 3302
942 2518
111 401
307 546
120 121
588 2099
2421 579
796 288
77 841
101 118
110 2456
555 2838
716 99
352 702
191 189
198 189
467 2959
109 972
3730 69
810 3985
440 283
2502 282
283 99
1753 746
68 79
302 1780
320 2996
2417 100
1441 665
1829 782
103 100
102 2664
93 303
2567 102
606 327
1912 1004
4462 268
3174 1338
2556 333
348 2075
276 3486
66 409
592 115
85 112
478 260
264 450
3588 301
4480 288
2223 496
718 1051
1102 923
387 606
4432 2720
469 78
1119 75
69 4351
239 4483
2855 1200
317 2964
367 1602
1447 2808
2054 396
67 1795
61 40
62 595
348 2992
70 2899
784 784
662 426
116 2821
1298 1999
3124 111
271 100
108 109
4412 3858
4429 772
55 1557
67 1556
211 166
1866 183
1129 1339
1543 178
274 2122
383 97
69 87
521 3819
288 99
100 466
1681 40
73 115
3317 437
511 92
2964 519
690 2765
41 45
435 283
1280 4332
515 112
84 3592
1448 103
1134 4529
782 3366
2932 115
1246 268
818 3197
1099 1152
104 105
393 10
1544 3930
116 689
891 107
4268 115
903 178
919 2726
593 2274
56 57
466 268
373 401
68 360
788 319
313 109
1209 1116
3318 487
301 272
3708 878
356 264
1125 824
3586 88
347 2456
314 1900
1135 960
423 55
83 1419
417 2886
317 3017
266 3017
449 1632
109 99
3680 652
1822 290
530 99
2454 802
593 2043
296 894
363 2101
346 121
1038 1474
538 115
108 463
302 1673
32 595
2026 115
805 465
69 1090
395 1794
3165 331
65 73
522 88
1519 116
4518 83
4325 621
34 46
4463 79
2421 440
71 2271
80 1973
69 3776
2800 48
4503 436
2299 71
2522 2522
79 2959
1863 414
348 802
118 311
738 475
4031 2875
4645 2539
281 115
341 414
119 3598
1812 333
86 1462
529 70
95 44
981 2612
229 144
110 534
277 1523
41 42
685 37
110 390
1303 115
233 128
68 3951
2244 3842
210 179
1578 76
209 134
70 1847
672 172
3534 84
361 3237
842 4310
102 1847
87 1060
383 1156
1550 1361
2454 3292
103 2271
616 1999
313 264
853 896
100 1444
3846 509
300 115
1822 713
32 4629
1369 116
84 401
223 182
3408 652
1552 3225
4103 1806
4692 3053
903 180
367 2901
1086 601
328 34
454 2573
478 911
646 1895
353 107
302 707
1830 383
1236 107
316 284
373 296
66 3690
478 261
2194 3612
106 430
320 99
2495 111
2410 4322
85 817
454 88
207 181
361 3564
401 446
683 372
1731 1730
408 892
1321 53
1173 289
302 948
1038 112
1301 4076
397 101
2219 501
1416 307
469 121
301 446
352 69
346 272
2268 1022
1244 83
290 99
425 123
72 4402
294 360
75 707
214 190
3224 1250
435 268
109 379
314 117
32 197
350 85
535 67
368 3520
1274 1657
408 1274
103 108
493 667
1103 285
4040 79
49 566
774 1727
314 116
3771 1429
32 678
84 509
407 102
77 77
279 1598
2840 115
76 281
78 1199
53 55
3750 3643
603 344
849 108
32 441
67 1025
356 3658
346 1289
120 111
1321 55
593 1656
298 881
489 121
2063 53
82 2573
433 448
105 290
106 960
110 582
382 529
399 3051
951 268
774 103
741 72
2446 520
101 896
312 1404
2887 1441
66 66
41 715
98 333
2468 1205
215 4244
113 540
415 319
2257 4466
4745 712
4804 331
1151 177
76 2856
314 108
345 648
53 50
340 4111
517 1116
467 2994
1502 55
1384 2829
230 156
4578 404
346 554
56 315
530 115
311 99
274 2278
65 112
738 1944
457 78
504 1219
32 221
346 112
314 2360
209 135
1736 112
314 297
1543 187
971 1196
277 1082
522 701
4341 115
1128 108
314 849
2740 1520
613 3051
1502 57
354 114
3252 182
356 877
642 52
109 2028
109 1702
66 67
356 1984
4349 333
212 182
186 175
116 4502
2736 905
80 115
2799 84
4037 4799
4858 386
355 47
753 1875
288 1629
70 67
1001 3457
822 570
296 102
673 3380
2180 846
272 773
39 282
313 100
384 1419
1142 519
1761 105
208 185
10 402
849 466
417 1205
1543 180
522 1270
108 920
314 97
76 1808
119 112
630 93
264 115
440 121
1842 2756
32 194
70 2754
353 1417
208 177
116 838
554 354
384 72
3023 1195
1778 73
1360 3645
1553 4075
2072 2162
32 294
842 3464
4593 78
313 1972
53 57
1649 336
98 707
1835 3465
408 424
70 1045
2194 3570
341 416
72 2970
99 276
613 3546
78 392
105 1608
2800 57
1604 1166
2188 2486
66 71
104 122
4787 72
103 708
82 85
469 1119
314 324
482 807
346 1172
55 50
79 440
2786 268
80 1900
375 272
518 2720
642 57
743 665
3203 2843
68 337
288 894
480 860
313 558
1487 120
346 108
840 103
3316 450
425 125
1567 996
469 540
77 4014
80 4395
76 689
423 54
455 2884
338 331
281 458
445 3352
727 330
70 2539
727 270
4170 2137
373 2240
215 170
301 914
108 319
4965 101
912 1189
3122 1139
84 386
208 191
1052 1166
601 319
518 1004
98 4000
67 1278
2208 1050
110 97
1896 387
281 1474
297 285
396 429
1865 51
111 105
229 155
352 641
2705 2604
97 2357
101 113
1635 4284
271 296
318 108
375 109
404 495
85 3596
3939 923
279 2282
98 103
119 2146
2159 333
